<a href="https://colab.research.google.com/github/sbj6364/python-study/blob/main/pandas-basic/22_missing_values4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# 22번 : missing values (4)

df_C에 등장하는 모든 NaN값을 전체 데이터의 평균 값으로 대체하는 방법으로 처리하는 코드를 작성해보세요.

#### output 참고
[FutureSkill 22](https://futureskill.io/content/903ab63c-2b24-4be0-ba1c-a3ba34dce258/question/cb702e3b-36d4-4565-9bda-2da413ca5a5e)

In [4]:
import pandas as pd
import numpy as np

df_C = pd.read_excel('toy.xlsx')
df_C

     A    B     C
0  1.0 -1.0   2.0
1  2.0  NaN   3.0
2  3.0 -3.0   4.0
3  4.0 -4.0   7.0
4  5.0  NaN   NaN
5  NaN -6.0  10.0

In [14]:
m = np.nanmean(df_C)
df = df_C.fillna(m)
df

          A         B          C
0  1.000000 -1.000000   2.000000
1  2.000000  1.928571   3.000000
2  3.000000 -3.000000   4.000000
3  4.000000 -4.000000   7.000000
4  5.000000  1.928571   1.928571
5  1.928571 -6.000000  10.000000